**Add a new column called "Result":**
```If a student scored >= 90, mark as "Excellent"
If a student scored 80â€“89, mark as "Good"
If a student scored < 80, mark as "Needs Improvement"```

In [1]:
import pandas as pd  

data = {
    "Name": ["Ali", "Sara", "John", "Mary", "Alex"],
    "Subject": ["Math", "Science", "Math", "Science", "Math"],
    "Marks": [85, 92, 78, 88, 95]
}

df = pd.DataFrame(data)
df

   Name  Subject  Marks
0   Ali     Math     85
1  Sara  Science     92
2  John     Math     78
3  Mary  Science     88
4  Alex     Math     95

In [7]:
def calc(marks):
    if marks>90:
        return "Excellent"
    elif marks>80 and marks<90:
        return "Good"
    else:
        return "Need improvement"
    
df["Result"] = df["Marks"].apply(calc)

In [9]:
df

   Name  Subject  Marks            Result
0   Ali     Math     85              Good
1  Sara  Science     92         Excellent
2  John     Math     78  Need improvement
3  Mary  Science     88              Good
4  Alex     Math     95         Excellent

In [8]:
#using np.where

In [10]:
import numpy as np

In [13]:
df["Result_numpy"] = np.where(df["Marks"]>90,"Excellent",np.where(df["Marks"]>=80,"Good","Need improvement"))

In [14]:
df

   Name  Subject  Marks            Result      Result_numpy
0   Ali     Math     85              Good              Good
1  Sara  Science     92         Excellent         Excellent
2  John     Math     78  Need improvement  Need improvement
3  Mary  Science     88              Good              Good
4  Alex     Math     95         Excellent         Excellent